Tekla Open API Reference for Tekla Structures 2025
AutoDirectionTypeEnum Enumeration
 The auto direction type defines how a connection or detail coordinate system will be oriented automatically.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AutoDirectionTypeEnum
Public Enumeration AutoDirectionTypeEnum
Members
Member name | Value | Description
AUTODIR_NA | 0 |  The auto direction will not be available.
AUTODIR_BASIC | 1 |  The auto direction type for usual joints will be used.
AUTODIR_DIAGONAL | 2 |  The auto direction type for diagonal joints will be used.
AUTODIR_SPLICE | 3 |  The auto direction type for splices will be used.
AUTODIR_DETAIL | 4 |  The auto direction type for details will be used.
AUTODIR_GLOBAL_Z | 5 |  The auto direction type with joint direction at the global Z will be used.
AUTODIR_SEATING | 6 |  The auto direction type for seating joints will be used.
AUTODIR_PRIMARY_X | 7 |  The auto direction type with joint direction parallel to the primary X-axis will be used.
AUTODIR_FROM_ATTRIBUTE_FILE | 99 |  The auto direction type is fetched from the loaded attribute file.
See Also
Reference
Tekla.Structures Namespace